In [1]:
import pandas as pd
import numpy as np

In [3]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)), index=[['a','a','b','b'],[1,2,1,2]], columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [4]:
frame1 = frame.stack().stack()
frame2 = frame.unstack().unstack()

In [5]:
frame1

a  1  Green  Colorado     2.0
             Ohio         0.0
      Red    Ohio         1.0
   2  Green  Colorado     5.0
             Ohio         3.0
      Red    Ohio         4.0
b  1  Green  Colorado     8.0
             Ohio         6.0
      Red    Ohio         7.0
   2  Green  Colorado    11.0
             Ohio         9.0
      Red    Ohio        10.0
dtype: float64

In [44]:
frame2.swaplevel(0,3).sort_index()

a  1  Green  Colorado     2
             Ohio         0
      Red    Ohio         1
   2  Green  Colorado     5
             Ohio         3
      Red    Ohio         4
b  1  Green  Colorado     8
             Ohio         6
      Red    Ohio         7
   2  Green  Colorado    11
             Ohio         9
      Red    Ohio        10
dtype: int32

In [45]:
left = pd.DataFrame({'id': [1, 2, 3, 4, 5], 'Name1': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 'subject_id': ['sub1', 'sub2', 'sub4', 'sub6', 'sub5']})
right = pd.DataFrame({'id': [1, 2, 3, 4, 5], 'Name2': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 'subject_id': ['sub2', 'sub4', 'sub3', 'sub5', 'sub6']})

In [47]:
df_union = pd.merge(left,right,how='outer')
df_union

   id   Name1 subject_id  Name2
0   1    Alex       sub1    NaN
1   2     Amy       sub2    NaN
2   3   Allen       sub4    NaN
3   4   Alice       sub6    NaN
4   5  Ayoung       sub5    NaN
5   1     NaN       sub2  Billy
6   2     NaN       sub4  Brian
7   3     NaN       sub3   Bran
8   4     NaN       sub5  Bryce
9   5     NaN       sub6  Betty